Model: "model_7"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_11 (InputLayer)          [(None, 100, 1)]     0           []                               
                                                                                                  
 input_12 (InputLayer)          [(None, 100, 1)]     0           []                               
                                                                                                  
 model_6 (Functional)           (None, 256)          714052      ['input_11[0][0]',               
                                                                  'input_12[0][0]']               
                                                                                                  
 lambda_3 (Lambda)              (None, 1)            0           ['model_6[0][0]',                
                                                                  'model_6[1][0]']                
                                                                                                  
 batch_normalization_13 (BatchN  (None, 1)           4           ['lambda_3[0][0]']               
 ormalization)                                                                                    
                                                                                                  
 dense_19 (Dense)               (None, 1)            2           ['batch_normalization_13[0][0]'] 
                                                                                                  
==================================================================================================
Total params: 714,058
Trainable params: 714,054
Non-trainable params: 4
__________________________________________________________________________________________________
